/* compute sum of numbers 1 to 100 (5050) */
options levelb
sum = 0
do i=1 to 100
   sum = i+sum
end
say "the sum of the numbers 1 to 100 is:" sum

/* compute sum of numbers 1 to 1000  */
sum = 0
do i=1 to 1000
   sum = i+sum
end
say "the sum of the numbers 1 to 1000 is:" sum

/* compute sum of numbers 1 to 10000  */
sum = 0
do i=1 to 10000
   sum = i+sum
end
say "the sum of the numbers 1 to 10000 is:" sum

/* compute sum of numbers 1 to 100000  */
sum = 0
do I=1 to 100000
   sum = i+sum
end
say "the sum of the numbers 1 to 100000 is:" sum
