/* t script for parser mode */
options levelb
a = 10 + 20
say "Hello, world!" a
if a > 15 then do
    say "It is big"
end
/* Missing end statement
end
