/* cREXX - Basic Sanity Tests */
options levelb
say "Test 1 - Say"

say "hello crexx!"
say 'hello crexx'
say hello crexx

/* some arithmetic */
say 1 + 1
say 0.2 - 0.1
say 800/81

return 0