/* Dummy Function */
options levelb

namespace scratch expose external

external = 3
say external

external: procedure = .int
  arg n = .int
  return n * n
