/* Tests for latest show and tells */
options levelb
namespace scratch
# comment
say "Début"

a  = 0
do i = 1 to 10

  a = a + i
  say i
end
say "a =" a

return 0
