/* rexx */
options levelb
import rxfnsb

say fnv("the quick fox jumps over the lazy brown fox")
say fnv("the quick fox jumps over the lazy fox")
say fnv("the quick fox jumps over the lazy sleeping fox")
