options levelb
/* Test Literals */
a = 123             /* Decimal */
b = "String"        /* String */
c = 'String'        /* Single Quote */
d = '414243'x       /* Hex String */
e = '1010'b         /* Binary String */
say a b c d e
