options levelb
/* Test DO loops */
/* Iterative */
do i = 1 to 5 by 2
    say i
end

/* While */
j = 0
do while j < 3
    say "While" j
    j = j + 1
end
