options levelb
/* Test SELECT */
say "SKIP: SELECT feature not implemented in compiler"
/*
a = 1
select
  when a=1 then say "One"
  otherwise say "Other"
end
*/
