options levelb
import rxfnsb
a = "Hello"
b = "World"
c = a || " " || b
say c
/* Abutment */
d = a " " b
say d
/* String functions (minimal) */
say length(c)
say substr(c, 1, 5)
say pos("World", c)
return
