options levelb

calls = 0

if 0 & do
  calls = calls + 1
  leave with 1
end then say "bad-and"
say calls

if 1 | do
  calls = calls + 10
  leave with 0
end then nop
say calls

if 1 & do
  calls = calls + 100
  leave with 1
end then say calls
