options levelb
import rxfnsb

say "count=" || arg()
say "count-bracket=" || arg[]
say "count-zero=" || arg[0]
say "count-dot=" || arg.
say "first-call=" || arg(1)
say "first-bracket=" || arg[1]
say "first-dot=" || arg.1

return 0
