options levelb

main: procedure = .int
  say "Starting say inline expr test..."
  do i = 1 to 3
    say asString(i)
  end
  say "Say inline expr test finished."
  return 0

asString: procedure = .string
  arg val = .int
  return val
