options levelb
namespace interface_default_main
import interface_default_dep_contract

main: procedure
  iface_value = .shape()
  class_value = .interface_default_dep_contract..box()
  say iface_value.describe()
  say class_value.describe()
  return
