options levelc
parse arg first . rest
parse upper pull line + 1 word
parse source os command
parse linein input
parse version interpreter
parse var source first second
parse value 'alpha beta' with first second
parse value left || right with joined
