options levelc

trace normal
trace "??"
trace 3
trace -3

address with input normal output append stream out.
address with output append stem out.

say 'F'X
say '0F 0A'X
say '1'B
say '0000 1111'B
