address = 1
arg = 2
call = 3
drop = 4
exit = 5
interpret = 6
nop = 7
numeric = 8
procedure = 9
pull = 10
push = 11
queue = 12
return = 13
signal = 14
trace = 15
say address arg call drop exit interpret nop numeric procedure pull push queue return signal trace
