options levelc
say 1 +
say 'after-plus'
say 1 *
say 'after-mult'
say 1 **
say 'after-power'
say 1 ||
say 'after-concat'
say 1 &
say 'after-and'
say 1 |
say 'after-or'
say 1 &&
say 'after-xor'
