options levelc
say 'literal' 1.5 1. .5
value=1.5
say 'value' value
say 'arithmetic' 1.5+2 .5+1
parse value 1.5 with parsed
say 'parse' parsed
say 'abutted' '['1.5']'
