options levelc
text='Aé🙂B'
blank='A0'x
words_text='é' || blank || '🙂'
say 'length=' || length(text)
say 'substr=' || substr(text,2,2)
say 'pos=' || pos('🙂',text)
say 'lastpos=' || lastpos('é','é🙂é')
say 'reverse=' || reverse(text)
say 'left=' || left(text,2)
say 'right=' || right(text,2)
say 'delstr=' || delstr(text,2,2)
say 'insert=' || insert('漢','AB',1)
say 'overlay=' || overlay('漢','AéB',2)
say 'changestr=' || changestr('é','é🙂é','漢')
say 'countstr=' || countstr('é','é🙂é')
say 'compare=' || compare('éX','éY')
say 'verify=' || verify('é🙂','é')
say 'abbrev=' || abbrev('é🙂','é')
say 'words=' || words(words_text)
say 'word=' || word(words_text,2)
say 'wordindex=' || wordindex(words_text,2)
say 'wordlength=' || wordlength(words_text,2)
say 'wordpos=' || wordpos('🙂',words_text)
say 'subword=' || subword(words_text,2)
say 'delword=' || delword(words_text,1,1)
say 'space=' || space(words_text,1,'|')
say 'strip=' || strip(blank || 'é' || blank)
say 'translate=' || translate('é🙂')
say 'upper=' || upper('é🙂')
say 'lower=' || lower('É🙂')
say 'copies=' || copies('é🙂',2)
say 'center=' || center('é',3,'.')
say 'leftpad=' || left('é',2,'.')
say 'rightpad=' || right('é',2,'.')
exit
