options levelc
变量 = 'unicode'
say symbol('变量')
say datatype('变量','S')
say datatype('变量','M')
say value('变量')
say datatype('é','L')
say datatype('É','U')
say datatype('🙂','S')
é = 7
say value('É')
signal 'κ'
say 'unreached'
Κ:
say 'label'
call 变量过程
say 'done'
exit
变量过程:
say 'routine'
return
