options levelc
signal on error name bad
signal on failure name bad
signal on halt name bad
signal on notready name bad
signal on lostdigits name bad
signal on novalue name bad
signal on syntax name bad
signal off error
signal off failure
signal off halt
signal off notready
signal off lostdigits
signal off novalue
signal off syntax
say 'all names'
exit
bad:
say 'bad'
