options levelc StRiCtC
if 0 then leave
if 0 then iterate
skip = 0
if skip then leave
if skip then iterate
do
  if 0 then leave
  if 0 then iterate
end
do i = 1 to 2
  if 0 then leave missing
  if 0 then iterate missing
  if i = 2 then leave
  say 'body' i
end
say 'after' i
