options levelc

trace banana
trace +
leave 10
iterate 10
10 = value

address system with input
address system with input stream
address system with input stream 10
address system with output append normal
address system with output append stem out

say 'AG'X
say '0102'B
say '0 F'X
say '0 1'B
