options levelc
numeric 10
arg a b
numeric "digits"
pull p q
procedure 10
say afterProcedure
procedure expose 10
say afterExpose
parse 10 template
say afterParse
parse upper 10 template
say afterParseUpper
drop 10
say afterDrop
call 10
say afterCall
signal 10
say afterSignal
