options levelc
numeric digits 3
signal on lostdigits name lost
say 'division' 1/3
say 'multiplication' 99*99
say 'safe' 1200+0
say 'before'
a = 1234 + 0
say 'after' a
exit
lost:
if condition('E') <> '' | condition('S') <> 'OFF' then exit 91; say 'caught' condition('C') condition('D') condition('I') sigl
exit
