options levelc
say 'provider-in' digits() fuzz() form()
numeric digits 6
numeric fuzz 2
numeric form scientific
say 'provider-out' digits() fuzz() form()
return
