options levelc
call
call +
call on
call on syntax
call off
call off syntax
call on error name
call on error name 7
call on error name .foo
call on error name .
nop
