options levelc
say unicodeversion()
say length('é')
say length('é')
say tonfc('é') == 'é'
say isnfd(tonfd('é'))
say isnfc(tonfc('é'))
say isnfkd(tonfkd('①'))
say isnfkc(tonfkc('①'))
say touppercase('Straße')
say tolowercase('ΟΣ')
say tocasefold('Straße')
say tosimplecasefold('Σ')
say toturkiccasefold('I')
say toturkicsimplecasefold('I')
say graphemecount('é🙂')
say graphemesubstr('é🙂',1,1)
say graphemepos('🙂','é🙂')
say graphemereverse('é🙂')
say c2x(encode('é'))
say decode('C3A9'x)
say c2x(encode('€','Windows-1252'))
say decode('80'x,'Windows-1252')
say isdecodable('FF'x)
say isdecodable('FF'x,'ISO-8859-1')
say isencodingsupported('IBM1047')
say isencodingsupported('unknown')
say decode(encode('漢🙂','UTF-16LE'),'UTF-16LE')
say tonfc('é') == 'é'
