options levelc
say 'provider-before=' || address() || '/' || address('O') || '/' || .rc || '/' || .rs
address crexx with output stem child.
'echo Child'
say 'provider-command=' || child.0 || '/' || child.1 || '/' || .rc || '/' || .rs
address crexx
say 'provider-after=' || address() || '/' || address('O') || '!'
return
