options levelc
numeric digits 0
say afterDigits
numeric digits "buzz"
say afterDigitsString
numeric digits "9"
say afterDigitsStringOk
numeric digits "bu
say afterOpenDouble
numeric fuzz -1
say afterFuzz
numeric fuzz "buzz"
say afterFuzzString
numeric fuzz "0"
say afterFuzzStringOk
numeric fuzz 'ba
say afterOpenSingle
numeric form value 'bad'
say afterFormBad
numeric form value 'engineering'
numeric form value 'scientific'
say afterFormOk
