options levelc
signal 'É'
say 'skip'
é:
say 'direct=' || sigl
call κ
say 'back'
signal value 'σ'
say 'skip'
Κ:
say 'call'
return
Σ:
say 'value=' || sigl
return
