options levelc

trace banana
trace +
leave 10
iterate 10
10 = value

address with input
address with input stream
address with input stream 10
address with output append normal
address with output append stem out

say 'AG'X
say '0102'B
say '0 F'X
say '0 1'B
