options levelc
if 0 then do
  say ABBREV()
  say ABS()
  say ADDRESS()
  say B2X()
  say BITAND()
  say BITOR()
  say BITXOR()
  say C2D()
  say C2X()
  say CENTER()
  say CENTRE()
  say CHANGESTR()
  say COMPARE()
  say COPIES()
  say COUNTSTR()
  say D2C()
  say D2X()
  say DATATYPE()
  say DATE()
  say DELSTR()
  say DELWORD()
  say DIGITS()
  say FORM()
  say FORMAT()
  say FUZZ()
  say INSERT()
  say LASTPOS()
  say LEFT()
  say LENGTH()
  say LOWER()
  say MAX()
  say MIN()
  say OVERLAY()
  say POS()
  say RANDOM()
  say REVERSE()
  say RIGHT()
  say SIGN()
  say SPACE()
  say STRIP()
  say SUBSTR()
  say SUBWORD()
  say SYMBOL()
  say TIME()
  say TRACE()
  say TRANSLATE()
  say TRUNC()
  say UPPER()
  say VALUE()
  say VERIFY()
  say WORD()
  say WORDINDEX()
  say WORDLENGTH()
  say WORDPOS()
  say WORDS()
  say X2B()
  say X2C()
  say X2D()
  say XRANGE()
end
say 'inventory'
