options levelc
numeric digits 18
say abbrev('abc','a')
say abbrev('abc','a',2)
say abbrev('abc','',0)
say b2x('0000 1111')
say b2x('1')
say b2x('')
say c2x(bitand(x2c('F0'),x2c('0F')))
say c2x(bitor(x2c('F0'),x2c('0F')))
say c2x(bitxor(x2c('FF'),x2c('0F')))
say c2d('A')
say c2d(x2c('FF'),1)
say c2d('AB',0)
say c2x('AB')
say center('abc',6,'.')
say centre('abcdef',3)
say compare('abc','abc')
say compare('ab','ab ',' ')
say compare('abc','adc')
say copies('ab',3)
say copies('x',0)
say countstr('aa','aaaaa')
say changestr('aa','aaaaa','b')
say c2x(d2c(65))
say c2x(d2c(-1,2))
say d2x(255)
say d2x(-1,4)
say datatype('1.20')
say datatype('abc')
say datatype('1.2','N')
say datatype('12.0','W')
say datatype('abc','L')
say datatype('ABC','U')
say datatype('AbC','M')
say datatype('abc123','A')
say datatype('AB CD','X')
say datatype('01 10','B')
say datatype('a.b','S')
say datatype('12','S')
say datatype('3name','S')
say datatype('.','S')
say delstr('abcdef',3,2)
say delstr('abc',5)
say delword(' a  b c ',2,1)
say insert('X','abc')
say insert('X','abc',2,3,'.')
say lastpos('a','banana')
say lastpos('a','banana',4)
say lastpos('','abc')
say left('ab',4,'.')
say left('abc',0)
say length('')
say length('a'||x2c('00')||'b')
say max('1.00','1.0')
say min('-2','-1')
say overlay('XY','abcdef',3)
say overlay('X','ab',4,2,'.')
say pos('a','banana',3)
say pos('','abc')
say reverse('abc')
say right('ab',4,'.')
say right('abc',0)
say space('  a   b  ')
say space(' a b ',0)
say space(' a b ',2,'.')
say strip('  abc  ')
say strip('..a..','L','.')
say substr('abc',2)
say substr('abc',4,2,'.')
say substr('abc',1,0)
say subword(' a  b c ',2,2)
say subword('a b',3)
say translate('abc')
say translate('abc','12','ac','.')
say translate('abc','','abc','.')
say trunc('-1.239',2)
say verify('abc','ac')
say verify('abc','ac','M')
say verify('','abc')
say word(' a b ',2)
say word('a',2)
say wordindex(' a  b',2)
say wordindex('a',2)
say wordlength(' a  bc',2)
say wordpos('b c','a b c b c',3)
say words(' a  b ')
say x2b('0F')
say c2x(x2c('F'))
say x2d('FF')
say x2d('FF',2)
say c2x(xrange('A','C'))
say digits()
say fuzz()
say form()
say condition()
say random(5,5,1)
say date('S','20240229','S')
say time('H','23:59:58','N')
a = 'value'
say symbol('a')
say value('a','next')
say a
say symbol('12')
call nested 'a',,'c'
exit 0
nested:
  procedure
  say arg()
  say arg(2,'O')
  say arg(3,'E')
  return
