options levelb

main: procedure
  input_lines = .string[]
  output_lines = .string[]
  error_text = .string
  user = "ALICE"
  address system "sort" input input_lines output output_lines error error_text expose user
  return
