options levelb
main: procedure
  x = 1
  do
    x = .int
    x = 10
  end
  say "Outside simple do: x =" x
  
  if x = 1 then say "SUCCESS: Simple DO is a subscope"
  else say "FAILURE: Simple DO is NOT a subscope"
  
  return
