/* UTF Test 多变的 */
options levelb
/* Chinese! */
多变的 = "多变的 is 'variable' in Chinese (according to Google!)"
SAY 多变的

équipe = "René Vincent Jansen"
équipe = équipe ", Mike Großmann"
équipe = équipe " and all the rest (this is just a UTF-8 test! 😊)"

Say "cREXX Équipe:" ÉQUIPE

/* The ß experiment */
Großmann = 1
GROßMANN = 2
GROẞMANN = 3 /* The new capital ẞ - TODO fix utp.h */
GROSSMANN = 4

say Großmann
say GROßMANN
say GROẞMANN
say GROSSMANN

/* The lexer knows that 😊 is not a letter and so is not a valid symbol name */
/* 😊 = "Smile" */