options levelb
import rxfnsb

main: procedure
a=.string[]
b=.string[]
j=0
max=11
do i=1 to max
   j=j+1
   a[i]="Line "i
   b[i]="Record "i
end

pprint a,3,9
say 'SUCCESS'


