/* This is a simple test */
options levelb
a = 5
b = 10.0
c = 30
d = 5
if d = a then say "d = a"
else say "d != a"
say "Result is " || (a + 7) * (b + c) + d
