/* This is a simple test
for the re2c / lemon REXX parser
  /* comment in a comment  */
*/

b = 1
x === 4
    say     (b  + 1) * 3

address cms listfile test file A


if b=1 then say "hello"
else say "bye"

/*
a === -3;
b = 10
parse var x with a . b
/* Note the error in the above - but the parser did "FALLBACK TK_WITH => TK_SYMBOL"
   i.e. with is a variable name not a keyword in this context - interesting if weird! */

   x.y = 2.1 * (3 + 1)
   x = "Hello"
/* xxx
     xx*/ a = 1;
start.me: Procedure expose a
do forever
  Say    x y;
end
return 0
*/