/* GETPI Plugin Test */
options levelb
import rxmath
import rxfnsb
say "ACOS "acos(0)
say "ASIN "asin(0)
say "ATAN "atan(90)
say "COS  "cos (90)
say "COSH "cosh(90)
say "EXP  "exp (90)
say "LOG "log (90)
say "LOG10 "log10(90)
## say pow10(90)
say "SIN  "sin (90)
say "SINH "sinh(90)
say "SQRT "sqrt(16)
say "TAN  "tan (90)
say "TANH "tanh(90)