/* rexx */
options levelb
import rxfnsb

say 111 fnv("The quick fox jumps over the lazy dog")
say 222 fnv("The quick brown fox jumps over the lazy black dog")
say 333 fnv("The quick brown fox jumps over the lazy sleeping black dog")
say 444 fnv("The quick fox jumps over a lazy do")

