/* WORDS */
options levelb
import rxfnsb

errors=0
/* These from the Rexx book. */
if words('The quick brown fox jumps over the lazy dog') \=  9 then do
  errors=errors+1
  say 'WORD failed in test 1 '
  end
