options levelb
import rxfnsb

main: procedure
a=.string[]
j=0
max=11
do i=1 to max
   j=j+1
   a[i]="Line "right(i,6,'0')
end

say 'Before'
do i=1 to a[0]
   say i a[i]
end
k=1
myOrder='DESCENDING'
sortx a,k+2,substr(myorder,1,4)

say 'After'
do i=1 to a[0]
   say i a[i]
end
say 'SUCCESS'
return
