options levelb
namespace rxpa_classdecl_user
import rxpa_classdecl

main: procedure
  env = make()
  native = make_native()
  factory_obj = .nativeenvironment("factory")

  say env.describe()
  say native.describe()
  say factory_obj.describe()
  return
