options levelb
namespace set1_lib
import set1_lib

main: procedure = .int expose glob_int glob_string
    say "Set 1 Main"
    say "glob_int is" glob_int
    say "glob_string is" glob_string

    say "is_true returns" is_true()
    say "is_false returns" is_false()

    call set_val(101)
    say "get_val returns" get_val()
    say "glob_int is now" glob_int

    return 0
