options levelb
import set3_lib

ints = get_int_array()
say "ints[1] =" ints[1]
say "ints[2] =" ints[2]
say "ints[3] =" ints[3]

items = get_person_array()
say "items[1] val =" items[1].get_val()
say "items[2] val =" items[2].get_val()
temp = .Item("Trigger")

return 0
