options levelb comments_dash
import id_id

say 'testing id class'

x = .id()
say 'uuid:     ' x.uuid()
say 'uuidv7:   ' x.uuidv7()
say 'uuidt:    ' x.uuidt()
say 'ulid:     ' x.ulid()
say 'nanoid:   ' x.nanoid()
say 'snowflake:' x.snowflake()
say 'base58:   ' x.base58()

