options levelb comments_dash
import data_List
import rxfnsb

l = .ArrayList()

say date() time()

-- rc = l.add("A")
-- rc = l.add("B")

-- say l.size()     -- 2
-- say l[2]         -- B

-- l[1] = "X"
-- say l.get(1)     -- X

-- say l.remove(1)  -- X
-- say l.isEmpty()  -- 0

rc = l.add('aap')
rc = l.add('noot')
rc = l.add('mies')
rc = l.add('wim')
rc = l.add('zus')
rc = l.add('jet')
rc = l.add('teun')
rc = l.add('vuur')
rc = l.add('gijs')
rc = l.add('lam')
rc = l.add('kees')
rc = l.add('bok')
rc = l.add('weide')
rc = l.add('does')
rc = l.add('hok')
rc = l.add('duif')
rc = l.add('schapen')

say l.size()


-- i = l.iterator()
-- loop while i.hasNext()
--   say i.next()
-- end
  
