#!/usr/local/crexx/rexx.sh
/* Comments */
options levelb comments_hash comments_slash comments_dash

# Hash Comments (this is enabled by default)
// Slash Comments
-- Dash Comments

say "hello Comments"
