#!/usr/local/crexx/rexx.sh
/* Comments */
options levelb hashcomments slashcomments dashcomments

# Hash Comments (this is enabled by default)
// Slash Comments
-- Dash Comments

say "hello Comments"
