#!/usr/local/crexx/rexx.sh
/* Comments */
options levelb dashcomments

# Hash Comments (this is enabled by default)
-- Dash Comments
// Slash Comments


say "hello Comments"

# TODO - Check a freeze with some comment option combinations
