#!/usr/local/crexx/rexx.sh
/* Comments */
options levelb noslashcomments nodashcomments hashcomments

# Hash Comments (this is enabled by default)
-- Dash Comments
// Slash Comments


say "hello Comments"

