#!/usr/local/crexx/rexx.sh
/* Comments */
options levelb comments_noslash comments_nodash comments_hash

# Hash Comments (this is enabled by default)
-- Dash Comments
// Slash Comments


say "hello Comments"

