#!/usr/local/crexx/rexx.sh
/* Types */
options levelb

say "Types"

/* Explicit */
a = .int
b = .string

a = 100
b = "Value is"

/* Conversion (in this case .int to .string) just happens */
say b a

/* Implicit */

c = 200
d = "Another Value is"
say d c