#!/usr/local/crexx/rexx.sh
/* Unicode */
options levelb
import rxfnsb /* This imports the standard library - for length() etc. */

rené = "René Jansen"

say RENÉ
say RENE

Say length(rené)
Say copies("=",40)
Say '='centre(rené,38)'='
Say copies("=",40)
Say copies("☺",40)