 /************************************************************************
 *.  B 2 X   9.6.1
 ************************************************************************/
 call CheckArgs  'rBIN'
 
 String=space(!Bif_Arg.1,0)
 return ReRadix(String,2,16)

