 /************************************************************************
 *.  D I G I T S    9.5.4
 ************************************************************************/
 call CheckArgs ''
 
 return !Digits.!Level
