 /************************************************************************
 *.  F O R M    9.5.6
 ************************************************************************/
 call CheckArgs ''
 
 return !Form.!Level
