 /************************************************************************
 *.  F U Z Z   9.5.7
 ************************************************************************/
 call CheckArgs ''
 
 return !Fuzz.!Level
