 /************************************************************************
 *.  Q U E U E D   9.8.2
 ************************************************************************/
 call CheckArgs ''

 Indication = Config_Queued()
 return !Outcome
