options levelb
import data_Stack

s = .Stack()

rc = s.push('aap')
rc = s.push('noot')
rc = s.push('mies')
rc = s.push('wim')
rc = s.push('zus')
rc = s.push('jet')
rc = s.push('teun')
rc = s.push('vuur')
rc = s.push('gijs')
rc = s.push('lam')
rc = s.push('kees')
rc = s.push('bok')
rc = s.push('weide')
rc = s.push('does')
rc = s.push('hok')
rc = s.push('duif')
rc = s.push('schapen')


say s.size()

say s.pop()

if \s.isEmpty() then say 'stack is not empty'




